pmo-dataset/variations/graphviz_with_ids/41.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Turn on bluetooth"];
  "User_2" [label="Enter type of\nMachine"];
  "User_3" [label="Enter serial number\nof machine"];
  "User_4" [label="Run 'Inspect-App'"];
  "User_5" [label="Check the fill\ncapacity"];
  "User_6" [label="Leave short Feedback"];
  "User_7" [label="Press 'Produce'\nbutton"];
  "User_8" [label="Press button 'Abort\nprocess'"];
  "Service_1" [label="Connecting to device"];
  "Service_2" [label="Save Answers"];
  "Service_3" [label="Auto collect values"];
  "Service_4" [label="Show data"];
  "Service_5" [label="Present results"];
  "StartNoneEvent_1" [shape=circle, label=""];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label=""];
  "ExclusiveGateway_1" [shape=diamond, label="Connected?"];
  "ExclusiveGateway_2" [shape=diamond, label="Is the fill level in\nthe bootle ok?"];
  "ExclusiveGateway_3" [shape=diamond, label="Is the cap position\nstraight?"];
  "ExclusiveGateway_4" [shape=diamond, label="Are the right\nbottles in the pack?"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "User_2" -> "User_3";
  "User_3" -> "Service_1";
  "StartNoneEvent_1" -> "User_1";
  "User_1" -> "User_4";
  "User_4" -> "User_2";
  "Service_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "User_5" [label="yes"];
  "User_5" -> "ExclusiveGateway_2";
  "Service_2" -> "User_7";
  "User_7" -> "ExclusiveGateway_4";
  "User_8" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Service_3";
  "ParallelGateway_1" -> "Service_4";
  "Service_4" -> "ParallelGateway_2";
  "Service_3" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Service_5";
  "Service_5" -> "EndNoneEvent_1";
  "ExclusiveGateway_1" -> "User_4" [label="no"];
  "ExclusiveGateway_3" -> "User_6" [label="no"];
  "ExclusiveGateway_4" -> "User_8" [label="no"];
  "ExclusiveGateway_2" -> "User_6" [label="no"];
  "User_6" -> "User_8";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3" [label="yes"];
  "ExclusiveGateway_3" -> "Service_2" [label="yes"];
  "ExclusiveGateway_4" -> "Service_5" [label="yes"];
}
