pmo-dataset/variations/mermaid_with_ids/41.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["Turn on bluetooth"]
	User_2["Enter type of\nMachine"]
	User_3["Enter serial number\nof machine"]
	User_4["Run 'Inspect-App'"]
	User_5["Check the fill\ncapacity"]
	User_6["Leave short Feedback"]
	User_7["Press 'Produce'\nbutton"]
	User_8["Press button 'Abort\nprocess'"]
	Service_1["Connecting to device"]
	Service_2["Save Answers"]
	Service_3["Auto collect values"]
	Service_4["Show data"]
	Service_5["Present results"]
	StartNoneEvent_1((" "))
	EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1{"Connected?"}
	ExclusiveGateway_2{"Is the fill level in\nthe bootle ok?"}
	ExclusiveGateway_3{"Is the cap position\nstraight?"}
	ExclusiveGateway_4{"Are the right\nbottles in the pack?"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	User_2 --> User_3
	User_3 --> Service_1
	StartNoneEvent_1 --> User_1
	User_1 --> User_4
	User_4 --> User_2
	Service_1 --> ExclusiveGateway_1
	ExclusiveGateway_1 -->|"yes"| User_5
	User_5 --> ExclusiveGateway_2
	Service_2 --> User_7
	User_7 --> ExclusiveGateway_4
	User_8 --> ParallelGateway_1
	ParallelGateway_1 --> Service_3
	ParallelGateway_1 --> Service_4
	Service_4 --> ParallelGateway_2
	Service_3 --> ParallelGateway_2
	ParallelGateway_2 --> Service_5
	Service_5 --> EndNoneEvent_1
	ExclusiveGateway_1 -->|"no"| User_4
	ExclusiveGateway_3 -->|"no"| User_6
	ExclusiveGateway_4 -->|"no"| User_8
	ExclusiveGateway_2 -->|"no"| User_6
	User_6 --> User_8
	ExclusiveGateway_2 -->|"yes"| ExclusiveGateway_3
	ExclusiveGateway_3 -->|"yes"| Service_2
	ExclusiveGateway_4 -->|"yes"| Service_5
